'''
*問題文*
非負整数L,Rが与えられます。
2つの整数i,jをL≤i<j≤Rを満たすように選びます。

(i×j)mod2019の最小値を求めてください。

*制約*
入力は全て整数
0≤L<R≤2×10^9

'''

'''

入力例 1 Copy
2020 2040
出力例 1
2
( i , j ) = ( 2020 , 2021 ) とすると、
( i × j ) mod 2019 = 2 となります。

(2019+1) * (2019+2)  % 2019 = 2

(2019(2019 + 1 + 2 ) + 2 )  % 2019 = 2

LR%2019

1: R <= 2019
    (i,j) = (R-1,R)
2: L <= 2019 <= R
    (i,j) = (2019,2020), (2018,2019) = 1
3: 2019 <= L
    (i,j) = 2019*

1: 2019*n < L,R < 2019*m
    (i,j) = (L,L+1)

2: 2019*(n-1) <= L <= 2019*n <= R <= 2019*(n+1)
    (i,j) = (1)

3: L <= 2019*n <= 2019*(m) <= R
    (i,j) = 2019*n * 2019*m = 0




'''

L, R = map(int, input().split())
modL = L%2019
modR = R%2019
ans = 0
if modL < modR:
    ans = modL*(modL+1)
elif modL > modR:
    ans = 1
else:
    ans = 0

print(ans)
